#### Terraform working directory 🏠: `demo/demo-account/network/security-group`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security-group.module.sg_rules["test-galvin-02"].module.ingress["allow-inbound"].aws_security_group_rule.cidr["0.0.0.0/0_tcp_3389_3389"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow jumphost rdp"
      + from_port                = 3389
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0f01fcc36f3f8859a"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3389
      + type                     = "ingress"
    }

  # module.security-group.module.sg_rules["test-sg"].module.ingress["allow-inbound"].aws_security_group_rule.cidr["0.0.0.0/0_tcp_22_22"] will be created
  + resource "aws_security_group_rule" "cidr" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow jumphost ssh"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01fc0daa5dce62d7f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @Galvin-wjw
**Action**: pull_request
